tsung/tsung_output/m4-16xlarge/critical.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="linksin-2-m4-16xlarge.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="1.5" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="6" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="60" unit="second">
      <users arrivalrate="20" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="60" unit="second">
      <users arrivalrate="25" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="60" unit="second">
      <users arrivalrate="35" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="11" duration="60" unit="second">
      <users arrivalrate="45" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="12" duration="60" unit="second">
      <users arrivalrate="55" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>

    <option name="file_server" id="userlist" value="userlist.csv"/>
  </options>

  <sessions>
    <session name="crit_path_test" probability="100" type="ts_http">
      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="iter">
          <var name="user_id"/>
          <var name="user_name"/>
          <var name="user_email"/>
      </setdynvars>

       <request>
        <http url="/" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>
      
      <thinktime value="10" random="true"/>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="/login" method="GET" version="1.1">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="5" max="10"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(user_name,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_user_name"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(user_email,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_user_email"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <dyn_variable name="user" re="Location: http://.*/users/(.*)\r"/>
        <http url="/login" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   session%5Bemail%5D=%%_encoded_user_email%%&amp;                                                                   session%5Bpassword%5D=meow123&amp;                                                                   user%5Bremember_me%5D=0&amp;                                                                   commit=Log+in" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/conversations" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   conversation%5Bsend_id%5D=%%_user%%&amp;                                                                   conversation%5Brecv_id%5D=1&amp;commit=Match" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="%%_redirect%%" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   message%5Bbody%5D=quack&amp;                                                                   message%5Buser_id%5D=%%_user%%&amp;commit=Send" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <request>
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/conversations" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   conversation%5Bsend_id%5D=%%_user%%&amp;                                                                   conversation%5Brecv_id%5D=2&amp;commit=Match" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="%%_redirect%%" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   message%5Bbody%5D=quack&amp;                                                                   message%5Buser_id%5D=%%_user%%&amp;commit=Send" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <request>
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/conversations" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   conversation%5Bsend_id%5D=%%_user%%&amp;                                                                   conversation%5Brecv_id%5D=3&amp;commit=Match" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="%%_redirect%%" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   message%5Bbody%5D=quack&amp;                                                                   message%5Buser_id%5D=%%_user%%&amp;commit=Send" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <request>
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/conversations" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   conversation%5Bsend_id%5D=%%_user%%&amp;                                                                   conversation%5Brecv_id%5D=4&amp;commit=Match" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="%%_redirect%%" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   message%5Bbody%5D=quack&amp;                                                                   message%5Buser_id%5D=%%_user%%&amp;commit=Send" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <request>
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/conversations" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   conversation%5Bsend_id%5D=%%_user%%&amp;                                                                   conversation%5Brecv_id%5D=5&amp;commit=Match" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="%%_redirect%%" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   message%5Bbody%5D=quack&amp;                                                                   message%5Buser_id%5D=%%_user%%&amp;commit=Send" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <request>
        <http url="/events" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="1" max="3"/>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/events/new" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" value="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <http url="/events" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   event%5Bname%5D=Meowathon&amp;event%5Bdate%5D=2020-12-20&amp;                                                                   event%5Btime%5D=08%3A05&amp;event%5Bdescription%5D=MeowMeowMeowMeowwwww&amp;commit=Create+Account" content_type="application/x-www-form-urlencoded">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>
    </session>
  </sessions>
</tsung>